tutorials/heatTransfer/buoyantPimpleFoam/hotRoomWithThermalShell/system/faSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    Ts_ceilingShell
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0.01;
    }

    jouleHeatingSource:V_ceilingShell
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0.01;
    }
}

nNonOrthCorr    1;

relaxationFactors
{
    T           1;
}


// ************************************************************************* //
